compute/conf/webServices/BlastNRequest.xml

<!--
  ~ Copyright (c) 2010-2011, J. Craig Venter Institute, Inc.
  ~
  ~ This file is part of JCVI VICS.
  ~
  ~ JCVI VICS is free software; you can redistribute it and/or modify it
  ~ under the terms and conditions of the Artistic License 2.0.  For
  ~ details, see the full text of the license in the file LICENSE.txt.  No
  ~ other rights are granted.  Any and all third party software rights to
  ~ remain with the original developer.
  ~
  ~ JCVI VICS is distributed in the hope that it will be useful in
  ~ bioinformatics applications, but it is provided "AS IS" and WITHOUT
  ~ ANY EXPRESS OR IMPLIED WARRANTIES including but not limited to
  ~ implied warranties of merchantability or fitness for any particular
  ~ purpose.  For details, see the full text of the license in the file
  ~ LICENSE.txt.
  ~
  ~ You should have received a copy of the Artistic License 2.0 along with
  ~ JCVI VICS.  If not, the license can be obtained from
  ~ "http://www.perlfoundation.org/artistic_license_2_0."
  -->

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:runBlastN xmlns:m="http://ws.compute.jacs.it.janelia.org/">
			<owner xsi:type="xsd:string">tsafford</owner>
			<jobName xsi:type="xsd:string">New DB Blast Test</jobName>
			<subjectDbIdentifier xsi:type="xsd:string">1265451958869688699</subjectDbIdentifier>
			<queryFastaFileNodeId xsi:type="xsd:string">1265448407435051387</queryFastaFileNodeId>
			<databaseAlignmentsPerQuery xsi:type="xsd:int">25</databaseAlignmentsPerQuery>
			<lowComplexityFiltering xsi:type="xsd:string">T</lowComplexityFiltering>
			<eValueExponent xsi:type="xsd:int">1</eValueExponent>
			<lowercaseFiltering xsi:type="xsd:boolean">false</lowercaseFiltering>
			<believeDefline xsi:type="xsd:boolean">false</believeDefline>
			<databaseSize xsi:type="xsd:long">0</databaseSize>
			<gapExtendCost xsi:type="xsd:int">-1</gapExtendCost>
			<gappedAlignment xsi:type="xsd:boolean">true</gappedAlignment>
			<hitExtensionThreshold xsi:type="xsd:int">0</hitExtensionThreshold>
			<matrix xsi:type="xsd:string">BLOSUM62</matrix>
			<multihitWindowSize xsi:type="xsd:int">0</multihitWindowSize>
			<searchStrand xsi:type="xsd:string">both</searchStrand>
			<ungappedExtensionDropoff xsi:type="xsd:int">20</ungappedExtensionDropoff>
			<bestHitsToKeep xsi:type="xsd:int">0</bestHitsToKeep>
			<finalGappedDropoff xsi:type="xsd:int">50</finalGappedDropoff>
			<gapOpenCost xsi:type="xsd:int">-1</gapOpenCost>
			<gappedAlignmentDropoff xsi:type="xsd:int">30</gappedAlignmentDropoff>
			<matchReward xsi:type="xsd:int">1</matchReward>
			<mismatchPenalty xsi:type="xsd:int">-3</mismatchPenalty>
			<searchSize xsi:type="xsd:int">0</searchSize>
			<showGIs xsi:type="xsd:boolean">false</showGIs>
			<wordsize xsi:type="xsd:int">11</wordsize>
		</m:runBlastN>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
